---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ISaveSharedCoordinatesCallback
source: html/d92529d6-8226-0b08-1f04-5a74207c4dca.htm
---
# ISaveSharedCoordinatesCallback Members

Determines whether Revit should save the link, not save the link,
 or discard shared positioning entirely.